app/views/orders/show.html.erb

SELECT "order_status_histories".* FROM "order_status_histories" WHERE "order_status_histories"."order_id" = $1  [["order_id", 1]]
---
</tr>
<% @order.order_status_history.each do |status| %>