app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = $1, "current_order_status" = $2 WHERE "orders"."id" = $3  [["updated_at", "2021-12-30 16:43:20.166049"], ["current_order_status", 3], ["id", 1]]
INSERT INTO "order_status_histories" ("name", "dateEntered", "dateComplete", "order_id", "created_at", "updated_at", "order_status") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def set_status
    @order = Order.find(params[:id])
    @order.update(current_order_status: params[:status])
    OrderStatusHistory.create(order_status: params[:status], order_id: params[:id], dateEntered: DateTime.now())